# Place in ~/ and run `brew bundle install`
#  Note that will require sudo password entry when installing sf-symbols cask
# Partially based on https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752

cask_args appdir: "/Applications"

brew "mas"

mas "Amphetamine", id: 937984704
mas "Apple Developer", id: 640199958
mas "Battery Monitor: Health, Info", id: 836505650
mas "Base - SQLite Editor", id: 402383384
mas "Charmstone", id: 1563735522
mas "DevCleaner for Xcode", id: 1388020431
mas "Icon Set Creator", id: 939343785
mas "Keyword Search", id: 1558453954
mas "Octotree", id: 1457450145 
mas "Play: Save Videos Watch Later", id: 1596506190
mas "Vimari", id: 1480933944
mas "XCOrganizer", id: 1507556912

# cask "1Password" - actually, maybe bad idea to install 1P via cask
cask "aerial"
cask "airbuddy"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "asset-catalog-tinkerer"
cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "blender"
cask "boop"
cask "cirrus"
cask "cleanshot"
cask "coconutbattery"
cask "contexts"
cask "dash"
cask "daisydisk"
cask "discord"
cask "figma"
cask "firefox"
cask "fork"
cask "github"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "kindle"
cask "keyboard-maestro"
cask "keyboardcleantool"
cask "latest"
cask "launchcontrol"
cask "mactracker"
cask "macvim"
cask "maestral"
# cask "marta"
cask "meetingbar"
cask "menubarx"
cask "messenger"
cask "mimestream"
cask "mochi"
cask "monodraw"
cask "moom"
cask "netnewswire"
cask "notion"
cask "omnidisksweeper"
cask "pdf-squeezer"
cask "plug"
cask "responsively"
cask "selfcontrol"
cask "sf-symbols"
cask "slack"
cask "soulver"
cask "spotify"
cask "stats"
cask "syntax-highlight"
cask "table-tool"
cask "textmate"
cask "tripmode"
cask "saulpw/vd/visidata"
cask "visual-studio-code"
cask "wordservice"
cask "xcodes"
cask "zoom"

tap 'homebrew/cask-fonts'
cask 'font-fantasque-sans-mono'

brew "direnv"
brew "clojure"
brew "cloudflared"
brew "cmake"
brew "dog"
brew "eska"
brew "fish"
brew "git-recent"
brew "jq"
brew "leiningen"
brew "node"
brew "openjdk"
brew "protobuf"
brew "scc"
brew "the_silver_searcher"
brew "tldr"
brew "wget"
brew "youtube-dl"
# Seems better to use rustup
# brew "rust"

# chip design packages
brew "gtkwave"
brew "icarus-verilog"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "verilator"
# from https://www.twam.info/software/using-the-icebreaker-with-an-open-source-fpga-toolchain-on-os-x
tap "twam/openfpga"
brew "icestorm"
brew "nextpnr", args: ["--without-arch-ecp5"]

brew "yosys"
# dependencies needed for yosys
brew "readline"
brew "minisat"
brew "xdot"
brew "graphviz"


# Not in cask or MAS:
#  - Hopper Disassembler
#  - MacSymbolicator
#  - TinkerTool
