# Place in ~/ and run `brew bundle install`
#  Note that will require sudo password entry when installing sf-symbols cask
# Partially based on https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752

cask_args appdir: "/Applications"

brew "mas"

mas "Amphetamine", id: 937984704
mas "Apple Developer", id: 640199958
mas "Battery Monitor: Health, Info", id: 836505650
mas "Charmstone", id: 1563735522
mas "DevCleaner for Xcode", id: 1388020431
mas "Icon Set Creator", id: 939343785
mas "Kindle", id: 405399194
mas "Messenger", id: 1480068668
mas "Play: Save Videos Watch Later", id: 1596506190
mas "Plug for Hype Machine", id: 1514182074
mas "Slack for Desktop", id: 803453959
mas "XCOrganizer", id: 1507556912

# cask "1Password" - actually, maybe bad idea to install 1P via cask
cask "aerial"
cask "airbuddy"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "asset-catalog-tinkerer"
cask "authy"
cask "bartender"
cask "cirrus"
cask "coconutbattery"
cask "contexts"
cask "discord"
cask "figma"
cask "firefox"
cask "fork"
cask "github"
cask "google-chrome"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "keyboard-maestro"
cask "launchcontrol"
cask "macvim"
cask "maestral"
cask "marta"
cask "mimestream"
cask "monodraw"
cask "moom"
cask "netnewswire"
cask "notion"
cask "omnidisksweeper"
cask "pdf-squeezer"
cask "responsively"
cask "selfcontrol"
cask "sf-symbols"
cask "soulver"
cask "spotify"
cask "stats"
cask "syntax-highlight"
cask "table-tool"
cask "textmate"
cask "visual-studio-code"
cask "xcodes"
cask "zoom"

tap 'homebrew/cask-fonts'
cask 'font-fantasque-sans-mono'

brew "clojure"
brew "dog"
brew "fish"
brew "git-recent"
brew "jq"
brew "leiningen"
brew "node"
brew "openjdk"
brew "the_silver_searcher"
brew "tldr"
brew "youtube-dl"
# Seems better to use rustup
# brew "rust"

# chip design packages
brew "gtkwave"
brew "icarus-verilog"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "verilator"
# from https://www.twam.info/software/using-the-icebreaker-with-an-open-source-fpga-toolchain-on-os-x
brew tap "twam/openfpga"
brew install "icestorm"
brew install "nextpnr" --without-arch-ecp5

brew "yosys"
# dependencies needed for yosys
brew "readline"
brew "minisat"
brew "xdot"
brew "graphviz"


# Not in cask or MAS:
#  - Hopper Disassembler
#  - MacSymbolicator
#  - TinkerTool
