# Place in ~/ and run `brew bundle install`
#  Note that will require sudo password entry when installing sf-symbols cask
# Partially based on https://gist.github.com/cliss/74782128b9a35366ecac44a7c4b45752

cask_args appdir: "/Applications"

brew "mas"

mas "1Blocker - Ad Blocker", id: 1365531024
mas "Amazon Kindle", id: 302584613
mas "Amazon Prime Video", id: 545519333
mas "Amphetamine", id: 937984704
mas "Apple Developer", id: 640199958
mas "Battery Monitor: Health, Info", id: 836505650
mas "Base - SQLite Editor", id: 402383384
mas "BBEdit", id: 404009241
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Charmstone", id: 1563735522
mas "Dropover", id: 1355679052
mas "DevCleaner for Xcode", id: 1388020431
mas "Hush Nag Blocker", id: 1544743900
mas "Icon Set Creator", id: 939343785
mas "Keyword Search", id: 1558453954
mas "Octotree", id: 1457450145 
mas "Play: Save Videos Watch Later", id: 1596506190
mas "rcmd • App Switcher", id: 1596283165
mas "ScreenFloat-Better Screenshots", id: 414528154
mas "Velja", id: 1607635845
mas "Vimari", id: 1480933944
mas "XCOrganizer", id: 1507556912

# cask "1Password" - actually, maybe bad idea to install 1P via cask
# cask "aerial"
cask "airbuddy"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "asset-catalog-tinkerer"
# cask "authy"
cask "bartender"
cask "bettertouchtool"
cask "blender"
cask "boop"
# cask "busycal"
# cask "cirrus"
cask "cleanshot"
cask "coconutbattery"
cask "contexts"
cask "dash"
cask "daisydisk"
cask "default-folder-x"
cask "drivedx"
cask "espanso"
cask "figma"
cask "firefox"
cask "fork"
cask "github"
cask "google-chrome"
cask "hazel"
cask "hex-fiend"
cask "iina"
cask "imagemagick"
cask "imageoptim"
cask "insomnia"
cask "iterm2"
cask "itsycal"
cask "karabiner-elements"
cask "keyboard-maestro"
cask "keyboardcleantool"
cask "latest"
cask "launchcontrol"
cask "macdown"
cask "mactracker"
# cask "macvim"
# cask "maestral"
# cask "mailmate"
cask "marked"
# cask "marta"
# cask "meetingbar"
cask "menubarx"
cask "messenger"
# cask "mimestream"
cask "mission-control-plus"
# cask "mochi"
cask "monitorcontrol"
cask "monodraw"
cask "moom"
cask "mx-power-gadget"
cask "netnewswire"
cask "notion"
cask "omnidisksweeper"
cask "openinterminal"
cask "orion"
cask "pdf-squeezer"
cask "phoenix"
cask "postico"
cask "quitter"
cask "raycast"
cask "responsively"
cask "roam-research"
# cask "selfcontrol"
cask "sf-symbols"
cask "slack"
cask "soulver"
cask "spaceman"
cask "spotify"
cask "stats"
cask "superkey"
cask "syntax-highlight"
cask "table-tool"
# cask "textmate"
cask "tg-pro"
cask "transmission"
cask "tripmode"
cask "saulpw/vd/visidata"
cask "virtualbuddy"
cask "visual-studio-code"
# cask "vitals"
cask "whichspace"
cask "wordservice"
cask "xcodes"
cask "zoom"

tap 'homebrew/cask-fonts'
cask 'font-barlow'
cask 'font-fantasque-sans-mono'
cask 'font-ibm-plex-mono'
cask 'font-ibm-plex-sans'
cask 'font-ibm-plex-serif'
cask 'font-inter'
cask 'font-jetbrains-mono'
cask 'font-nunito-sans'
cask 'font-poppins'
cask 'font-source-code-pro'

brew "age"
brew "asroute"
brew "clojure"
brew "cloudflared"
brew "cmake"
brew "direnv"
brew "dog"
brew "duti"
brew "eska"
brew "fasd"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git-delta"
brew "git-recent"
brew "gmailcontrol"
brew "gping"
brew "ipinfo-cli"
brew "jq"
brew "leiningen"
brew "llm"
brew "mkcert"
brew "netlify-cli"
brew "node"
brew "openjdk"
brew "pdfgrep"
brew "protobuf"
brew "ripgrep-all"
brew "rsync"
brew "scc"
brew "smartmontools"
brew "starship"
brew "the_silver_searcher"
brew "tldr"
brew "vim"
brew "wget"
# brew "youtube-dl"
brew "yt-dlp"
# Seems better to use rustup
# brew "rust"

# chip design packages
brew "gtkwave"
brew "icarus-verilog"
brew "sdl2"
brew "sdl2_gfx"
brew "sdl2_image"
brew "verilator"
# from https://www.twam.info/software/using-the-icebreaker-with-an-open-source-fpga-toolchain-on-os-x
tap "twam/openfpga"
brew "icestorm"
brew "nextpnr", args: ["--without-arch-ecp5"]

brew "yosys"
# dependencies needed for yosys
brew "readline"
brew "minisat"
brew "xdot"
brew "graphviz"


# Not in cask or MAS:
#  - Homerow
#  - Hopper Disassembler
#  - Keyboard Scroller
#  - MacSymbolicator
#  - Smart Scroll
#  - TinkerTool
